wayyoung/wayz/include/zephyr/dt-bindings/clock/n32g430-clock.h
/*
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_DT_BINDINGS_CLOCK_N32G430_CLOCK_H_
#define ZEPHYR_DT_BINDINGS_CLOCK_N32G430_CLOCK_H_

#define N32_AHBPCLKEN_OFFSET  0x14
#define N32_APB2PCLKEN_OFFSET 0x18
#define N32_APB1PCLKEN_OFFSET 0x1c

#define N32_CLOCK_DMA1        ((N32_AHBPCLKEN_OFFSET << 6) | 0) // RCC_AHBPCLKEN.0
#define N32_CLOCK_SRAM        ((N32_AHBPCLKEN_OFFSET << 6) | 2) // RCC_AHBPCLKEN.2
#define N32_CLOCK_FLITF       ((N32_AHBPCLKEN_OFFSET << 6) | 4) // RCC_AHBPCLKEN.4
#define N32_CLOCK_CRC         ((N32_AHBPCLKEN_OFFSET << 6) | 6) // RCC_AHBPCLKEN.6
#define N32_CLOCK_GPIOA       ((N32_AHBPCLKEN_OFFSET << 6) | 7) // RCC_AHBPCLKEN.7
#define N32_CLOCK_GPIOB       ((N32_AHBPCLKEN_OFFSET << 6) | 8) // RCC_AHBPCLKEN.8
#define N32_CLOCK_GPIOC       ((N32_AHBPCLKEN_OFFSET << 6) | 9) // RCC_AHBPCLKEN.9
#define N32_CLOCK_GPIOD       ((N32_AHBPCLKEN_OFFSET << 6) | 10) // RCC_AHBPCLKEN.10
#define N32_CLOCK_ADC1        ((N32_AHBPCLKEN_OFFSET << 6) | 12) // RCC_AHBPCLKEN.12
     
#define N32_CLOCK_AFIO        ((N32_APB2PCLKEN_OFFSET << 6) | 0) // RCC_APB2PCLKEN.0
#define N32_CLOCK_BEEPEN      ((N32_APB2PCLKEN_OFFSET << 6) | 1) // RCC_APB2PCLKEN.1
#define N32_CLOCK_TIM1        ((N32_APB2PCLKEN_OFFSET << 6) | 11) // RCC_APB2PCLKEN.11
#define N32_CLOCK_SPI1        ((N32_APB2PCLKEN_OFFSET << 6) | 12) // RCC_APB2PCLKEN.12
#define N32_CLOCK_TIM8        ((N32_APB2PCLKEN_OFFSET << 6) | 13) // RCC_APB2PCLKEN.13
#define N32_CLOCK_USART1      ((N32_APB2PCLKEN_OFFSET << 6) | 14) // RCC_APB2PCLKEN.14
#define N32_CLOCK_UART3       ((N32_APB2PCLKEN_OFFSET << 6) | 17) // RCC_APB2PCLKEN.17
#define N32_CLOCK_UART4       ((N32_APB2PCLKEN_OFFSET << 6) | 18) // RCC_APB2PCLKEN.18
#define N32_CLOCK_SPI2        ((N32_APB2PCLKEN_OFFSET << 6) | 19) // RCC_APB2PCLKEN.19
     
#define N32_CLOCK_TIM2        ((N32_APB1PCLKEN_OFFSET << 6) | 0) // RCC_APB1PCLKEN.0
#define N32_CLOCK_TIM3        ((N32_APB1PCLKEN_OFFSET << 6) | 1) // RCC_APB1PCLKEN.1
#define N32_CLOCK_TIM4        ((N32_APB1PCLKEN_OFFSET << 6) | 2) // RCC_APB1PCLKEN.2
#define N32_CLOCK_TIM5        ((N32_APB1PCLKEN_OFFSET << 6) | 3) // RCC_APB1PCLKEN.3
#define N32_CLOCK_TIM6        ((N32_APB1PCLKEN_OFFSET << 6) | 4) // RCC_APB1PCLKEN.4
#define N32_CLOCK_COMP        ((N32_APB1PCLKEN_OFFSET << 6) | 6) // RCC_APB1PCLKEN.6
#define N32_CLOCK_COMP_FILT   ((N32_APB1PCLKEN_OFFSET << 6) | 7) // RCC_APB1PCLKEN.7
#define N32_CLOCK_WWDG        ((N32_APB1PCLKEN_OFFSET << 6) | 11) // RCC_APB1PCLKEN.11
#define N32_CLOCK_USART2      ((N32_APB1PCLKEN_OFFSET << 6) | 17) // RCC_APB1PCLKEN.17
#define N32_CLOCK_I2C1        ((N32_APB1PCLKEN_OFFSET << 6) | 21) // RCC_APB1PCLKEN.21
#define N32_CLOCK_I2C2        ((N32_APB1PCLKEN_OFFSET << 6) | 22) // RCC_APB1PCLKEN.22
#define N32_CLOCK_CAN1        ((N32_APB1PCLKEN_OFFSET << 6) | 25) // RCC_APB1PCLKEN.25
#define N32_CLOCK_PWR         ((N32_APB1PCLKEN_OFFSET << 6) | 28) // RCC_APB1PCLKEN.28
     

/** @addtogroup AHB_peripheral
 * @{
 */

#define N32_RCC_AHB_PERIPH_DMA1   (1UL << 0)
#define N32_RCC_AHB_PERIPH_SRAM   (1UL << 2)
#define N32_RCC_AHB_PERIPH_FLITF  (1UL << 4)
#define N32_RCC_AHB_PERIPH_CRC    (1UL << 6)
#define N32_RCC_AHB_PERIPH_GPIOA  (1UL << 7)
#define N32_RCC_AHB_PERIPH_GPIOB  (1UL << 8)
#define N32_RCC_AHB_PERIPH_GPIOC  (1UL << 9)
#define N32_RCC_AHB_PERIPH_GPIOD  (1UL << 10)
#define N32_RCC_AHB_PERIPH_ADC1   (1UL << 12)


// #define IS_N32_RCC_AHB_PERIPH(PERIPH) ((((PERIPH)&0xFFFC02A8) == 0x00) && ((PERIPH) != 0x00))

/**
 * @}
 */

/** @addtogroup APB2_peripheral
 * @{
 */

#define N32_RCC_APB2_PERIPH_AFIO   (1UL << 0)
#define N32_RCC_APB2_PERIPH_BEEPEN (1UL << 1)
#define N32_RCC_APB2_PERIPH_TIM1   (1UL << 11)
#define N32_RCC_APB2_PERIPH_SPI1   (1UL << 12)
#define N32_RCC_APB2_PERIPH_TIM8   (1UL << 13)
#define N32_RCC_APB2_PERIPH_USART1 (1UL << 14)
#define N32_RCC_APB2_PERIPH_UART3  (1UL << 17)
#define N32_RCC_APB2_PERIPH_UART4  (1UL << 18)
#define N32_RCC_APB2_PERIPH_SPI2   (1UL << 19)


// #define IS_N32_RCC_APB2_PERIPH(PERIPH) ((((PERIPH)&0xFFE08602) == 0x00) && ((PERIPH) != 0x00))
/**
 * @}
 */

/** @addtogroup APB1_peripheral
 * @{
 */

#define N32_RCC_APB1_PERIPH_TIM2      (1UL << 0)
#define N32_RCC_APB1_PERIPH_TIM3      (1UL << 1)
#define N32_RCC_APB1_PERIPH_TIM4      (1UL << 2)
#define N32_RCC_APB1_PERIPH_TIM5      (1UL << 3)
#define N32_RCC_APB1_PERIPH_TIM6      (1UL << 4)
#define N32_RCC_APB1_PERIPH_COMP      (1UL << 6)
#define N32_RCC_APB1_PERIPH_COMP_FILT (1UL << 7)
#define N32_RCC_APB1_PERIPH_WWDG      (1UL << 11)
#define N32_RCC_APB1_PERIPH_USART2    (1UL << 17)
#define N32_RCC_APB1_PERIPH_I2C1      (1UL << 21)
#define N32_RCC_APB1_PERIPH_I2C2      (1UL << 22)
#define N32_RCC_APB1_PERIPH_CAN1      (1UL << 25)
#define N32_RCC_APB1_PERIPH_PWR       (1UL << 28)

// #define IS_N32_RCC_APB1_PERIPH(PERIPH) ((((PERIPH)&0x41013300) == 0x00) && ((PERIPH) != 0x00))


#endif /* ZEPHYR_DT_BINDINGS_CLOCK_N32G4FR_CLOCK_H_ */
